Собаки и тарелки

Постановка задачи: программа 
должна уметь создавать котов и 
тарелки с едой. В тарелке имеется 
какое-то количество еды. Кот должен 
уметь кушать еду из тарелок в 
соответствии со своим аппетитом.
Сделаем набросок кода:
Пока у нас есть отдельно коты, и 
отдельно тарелки

Собаки и тарелки
Давайте считать что в cобак и тарелках мы объявили геттеры и сеттеры.
Тогда код кормёжки собаки может выглядеть вот так:

public class Main {
 public static void main(String[] args) {
 Dog dog = new Dog("Heimerich", 6);
 Plate plate = new Plate(300);
 plate.info();
 dog.eat();
 plate.setFood(plate.getFood() - cat.getAppetite());
 }
}

Мы задаем тарелке количество еды равное количеству еды, которое там было, 
минус аппетит собаки. Работать будет, но подход не очень хороший!


